Pandas 
- it is library which operates on different dataframes

In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=["row1","row2","row3" , "row4" , "row5"] , columns=["column1" , "column2" , "column3" ,"column4"])

In [7]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [9]:
df.to_csv("test.csv")

### Accessing the elements

## 1.loc -> it only focuses on row 

## 2. iloc -> it focuses on row as well as columns

### <i>1 . loc</i>

In [11]:
df.loc["row1"]

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [12]:
type(df.loc["row1"])

pandas.core.series.Series

- if we get only <b>one column</b> values or <b>only one row</b> values so , it is called as a <b>Data Series</b> 
- OW if we have <b>more than 1 row and column</b> , it is called as <b>dataframe</b>

### <i>2 . iloc</i>

In [13]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [14]:
df.iloc[:2,:3]

      column1  column2  column3
row1        0        1        2
row2        4        5        6

In [15]:
type(df.iloc[:2,:3])

pandas.core.frame.DataFrame

In [16]:
# Converting dataframes into an array format
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [17]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [24]:
df["column1"].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [25]:
df["column1"].unique()

array([ 0,  4,  8, 12, 16])

In [23]:
df[["column3" , "column2"]]

      column3  column2
row1        2        1
row2        6        5
row3       10        9
row4       14       13
row5       18       17

In [26]:
df = pd.read_csv("train.csv")
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

## describe doesn't consider the Categorical columns or values

In [28]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [33]:
# how many time category is present in df
df["X0"].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
aq     18
i      18
am     18
u      17
l      16
aw     16
ad     14
au     11
b      11
k      11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
g       1
ac      1
Name: X0, dtype: int64

## Reading CSV file in different ways

In [39]:
from io import StringIO , BytesIO

In [53]:
data = (
        "col1,col2,col3\n"
        "x,y,z\n"
        "a,b,c\n"
        "1,2,3"
       )

In [54]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    z
1    a    b    c
2    1    2    3

In [55]:
type(data)

str

In [59]:
# usecols  : returns specified columns only
pd.read_csv(StringIO(data) , usecols=['col1','col3'])

  col1 col3
0    x    z
1    a    c
2    1    3

In [63]:
data = (
        "col1, col2, col3\n"
        "1,2,3\n"
        "4,5,6\n"
        "7,8,9"
        )
df = pd.read_csv(StringIO(data),dtype=int)
df.head()

   col1   col2   col3
0     1      2      3
1     4      5      6
2     7      8      9

In [67]:
df['col1'][2]

7

In [71]:
data = (
        "index,a,b,c\n"
        "0,apple,banana,chicoo\n"
        "1,x,y,z"
        )

In [72]:
data

'index,a,b,c\n0,apple,banana,chicoo\n1,x,y,z'

In [73]:
pd.read_csv(StringIO(data))

   index      a       b       c
0      0  apple  banana  chicoo
1      1      x       y       z

In [74]:
pd.read_csv(StringIO(data) , index_col=0)

           a       b       c
index
0      apple  banana  chicoo
1          x       y       z

In [84]:
data = (
        "a,b,c\n"
        "4,x,y\n"
        "8,l,m"
)

In [85]:
pd.read_csv(StringIO(data),index_col=False)

   a  b  c
0  4  x  y
1  8  l  m

In [86]:
pd.read_csv(StringIO(data),usecols=['a','b'])

   a  b
0  4  x
1  8  l